#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Mental Athlete ToDo List
#+SUBTITLE:  Life in a plain text
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both
# :session :cache yes :tangle yes :comments org 
#+CATEGORY: Thesis
#+TODO: TODO | MAYBE DONE

* TODO [#A] Time Management

** DONE General concepts overview
   SCHEDULED: <2018-02-26 Mon 10:00>
   DEADLINE: <2018-02-26 Mon 12:00>

** TODO [#C] Implementation in Org-mode studying
   SCHEDULED: <2018-02-26 Mon 10:00>
   DEADLINE: <2018-02-26 Mon 12:00>

** TODO Configuring Gnome3 desktops
   :PROPERTIES:
   :CATEGORY: Desktop
   :END:
   DEADLINE: <2018-02-28 Wed 13:00> SCHEDULED: <2018-02-28 Wed 12:00>
   It might be convinient to allocate the particular window of each
   applicaton on several (appropriate 4) desktops to switch between
   tasks in a smooth manner, just by switching current desktop.

* English
** Grammar
*** TODO Past tenses
    DEADLINE: <2018-02-15 Thu 13:00>
    Elaborate an initial [[file:/usr/local/git/0--key/lib/org/eng_grammar.org::*Past%20simple][org-drill]]
** Vocabulary
** Writing
* Emacs
** Org-mode
*** DONE Calendar
    SCHEDULED: <2018-02-09 Fri 08:20>
*** TODO [#B] Agenda rigorous dissection
    SCHEDULED: <2018-02-26 Mon 16:00> DEADLINE: <2018-02-26 Mon 17:00>
    - Export int .ics
    - Import into specific Google Calendar
**** DONE Timestamps
    <2018-02-28 Wed 17:30-18:25> 
**** DONE Creating timestamps
     <2018-02-28 Wed 18:30-18:55>
**** DONE Deadlines and scheduling
     <2018-02-28 Wed 19:00-19:25>
**** DONE Additional state 'MayBe'
     <2018-02-28 Wed 19:30-19:55>
**** DONE Clocking work time
     <2018-03-01 Thu 09:00-09:25>
**** DONE Effort estimates
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 09:39]--[2018-03-01 Thu 09:53] =>  0:14
     :END:
     <2018-03-01 Thu 09:30-09:55>
**** DONE Timers
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 09:59]--[2018-03-01 Thu 10:02] =>  0:03
     :END:
     <2018-03-01 Thu 10:00-10:25>
**** DONE Org-pomodoro
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 10:03]--[2018-03-01 Thu 10:12] =>  0:09
     :END:
     <2018-03-01 Thu 10:30-10:55>
*** TODO Capture
    DEADLINE: <2018-02-22 Thu 18:00> SCHEDULED: <2018-02-22 Thu 17:00>
    Make capture for org-drill items generation with minimal
    interruption
*** TODO Macros
    DEADLINE: <2018-02-22 Thu 13:00> SCHEDULED: <2018-02-22 Thu 12:30>
    To convert =voca-builder= item into =Drill=
** Python-mode
* Programming
** Theory
*** Formal Methods of Software Design
**** TODO Introduction
     SCHEDULED: <2018-02-13 Tue 08:30>
**** TODO Extract the binary terminology
     SCHEDULED: <2018-02-17 Sat 13:30>
** Practice
*** Data Visualisation
    SCHEDULED: <2018-02-20 Tue 18:00>
*** Big data meta-analysis
    SCHEDULED: <2018-02-27 Tue 17:00>

